In [47]:
import pandas as pd
import numpy as np
from sklearn.ensemble import RandomForestRegressor
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error

In [48]:
df=pd.read_csv('ds_salaries.csv')
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [4]:
df.describe()

         work_year        salary  salary_in_usd  remote_ratio
count  3755.000000  3.755000e+03    3755.000000   3755.000000
mean   2022.373635  1.906956e+05  137570.389880     46.271638
std       0.691448  6.716765e+05   63055.625278     48.589050
min    2020.000000  6.000000e+03    5132.000000      0.000000
25%    2022.000000  1.000000e+05   95000.000000      0.000000
50%    2022.000000  1.380000e+05  135000.000000      0.000000
75%    2023.000000  1.800000e+05  175000.000000    100.000000
max    2023.000000  3.040000e+07  450000.000000    100.000000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB

In [6]:
df.nunique()

work_year                4
experience_level         4
employment_type          4
job_title               93
salary                 815
salary_currency         20
salary_in_usd         1035
employee_residence      78
remote_ratio             3
company_location        72
company_size             3
dtype: int64

In [12]:
df1=df.drop(['salary','salary_currency','remote_ratio','employee_residence'],axis=1)
df1

,work_year,experience_level,employment_type,job_title,salary_in_usd,company_location,company_size
0,0,0,0,0,85847,0,0
1,0,1,1,1,30000,1,1
2,0,1,1,1,25500,1,1
3,0,0,0,2,175000,2,2
4,0,0,0,2,120000,2,2
...,...,...,...,...,...,...,...
3750,2,0,0,2,412000,1,0
3751,3,1,0,0,151000,1,0
3752,2,2,0,2,105000,1,1
3753,2,2,1,20,100000,1,0
3754,3,0,0,26,94665,6,0

In [16]:
df1['work_year']=pd.factorize(df1['work_year'])[0]
df1['experience_level']=pd.factorize(df1['experience_level'])[0]
df1['employment_type']=pd.factorize(df1['employment_type'])[0]
df1['job_title']=pd.factorize(df1['job_title'])[0]
df1['company_location']=pd.factorize(df1['company_location'])[0]
df1['company_size']=pd.factorize(df1['company_size'])[0]

In [17]:
df1['work_year']=df1['work_year'].astype('category')
df1['experience_level']=df1['experience_level'].astype('category')
df1['employment_type']=df1['employment_type'].astype('category')
df1['job_title']=df1['job_title'].astype('category')
df1['company_location']=df1['company_location'].astype('category')
df1['company_size']=df1['company_size'].astype('category')

In [19]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   work_year         3755 non-null   category
 1   experience_level  3755 non-null   category
 2   employment_type   3755 non-null   category
 3   job_title         3755 non-null   category
 4   salary_in_usd     3755 non-null   int64
 5   company_location  3755 non-null   category
 6   company_size      3755 non-null   category
dtypes: category(6), int64(1)
memory usage: 57.6 KB

In [45]:
df1

,work_year,experience_level,employment_type,job_title,salary_in_usd,company_location,company_size
0,0,0,0,0,85847,0,0
1,0,1,1,1,30000,1,1
2,0,1,1,1,25500,1,1
3,0,0,0,2,175000,2,2
4,0,0,0,2,120000,2,2
...,...,...,...,...,...,...,...
3750,2,0,0,2,412000,1,0
3751,3,1,0,0,151000,1,0
3752,2,2,0,2,105000,1,1
3753,2,2,1,20,100000,1,0
3754,3,0,0,26,94665,6,0

In [21]:
df1.describe()

       salary_in_usd
count    3755.000000
mean   137570.389880
std     63055.625278
min      5132.000000
25%     95000.000000
50%    135000.000000
75%    175000.000000
max    450000.000000

In [42]:
table1=pd.crosstab(df1['work_year'],df1['experience_level'],margins=True)
table1

experience_level     0    1    2    3   All
work_year
0                 1287  320  118   60  1785
1                 1138  361  124   41  1664
2                   18   32   23    3    76
3                   73   92   55   10   230
All               2516  805  320  114  3755

In [23]:
table2=pd.crosstab(df1['employment_type'],df1['salary_in_usd'])
table2

salary_in_usd,5132,5409,5679,5707,5723,5882,6072,6270,6304,6359,...,376080,380000,385000,405000,412000,416000,423000,423834,430967,450000
employment_type,,,,,,,,,,,,,,,,,,,,,
0,1,1,1,1,1,1,2,1,1,1,...,1,1,1,1,1,0,1,1,1,1
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [24]:
table3 = pd.pivot_table(df1, index='experience_level', columns='employment_type', values='salary_in_usd', aggfunc=np.mean)
print(table3.head(30))

employment_type               0         1             2        3
experience_level
0                 153214.454799   97500.0  53333.333333      NaN
1                 105321.489899   78600.0  41615.600000  42561.0
2                  80496.529801   65234.5  75000.000000  38885.0
3                 192974.566372  416000.0           NaN      NaN

In [65]:
table4 = pd.crosstab(df['work_year'],df['company_size'],values=df['salary_in_usd'], aggfunc='max',margins=True)
print(table4)

company_size       L       M       S     All
work_year
2020          412000  450000  260000  450000
2021          423000  200000  416000  423000
2022          405000  430967  275000  430967
2023          423834  385000  200000  423834
All           423834  450000  416000  450000

Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.

In [33]:
table5 = pd.crosstab(df['experience_level'],df['company_size'],values=df['salary_in_usd'], aggfunc='min')
print(table5)

company_size          0      1      2
experience_level
0                  8000  10000  18907
1                  6072   5679   5132
2                  5409   6072   5707
3                 76309  69741  15000

# HELLO WORLD

In [49]:
table6=pd.crosstab(df1['job_title'],df1['company_size'],margins=True)
table6.head(5)

company_size   0   1    2  All
job_title
0              4   1    3    8
1              6   6   22   34
2             99  28  713  840
3             30   0   28   58
4             38  18  556  612

In [57]:
x=df1.drop('salary_in_usd',axis=1)
y=df1['salary_in_usd']

In [58]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,random_state=42)

In [59]:
model=RandomForestRegressor(n_estimators=100,random_state=42)

In [60]:
model.fit(x_train,y_train)

RandomForestRegressor(random_state=42)

In [61]:
y_pred=model.predict(x_test)
y_pred

array([216699.83      , 128503.60163413, 157686.35097375, ...,
       180673.11847284,  38792.4425    , 128503.60163413])

In [63]:
mse=mean_squared_error(y_test,y_pred)
print('mean squared error:',mse)

mean squared error: 2585033050.827414

In [64]:
r2=model.score(x_test,y_test)
print("R-squared:",r2)

R-squared: 0.3479838846023948